app/Controllers/Publik.php

    public function index()
    {
        $data['title'] = "Home";
        $data['panel'] = "home";

        $artikel = $this->ARM->select('*')->join('tb_kategori_artikel', 'tb_artikel.artikel_kategori = tb_kategori_artikel.kategori_id')->where('artikel_status', '1')->where('artikel_akses', 'Published')->orderBy('artikel_create_time', 'DESC')->limit(4)->get()->getResult();
        $data['artikel'] = $artikel;

        $data['pasar'] = $this->PM->where('pasar_status', '1')->countAllResults();
---
SELECT *
FROM `tb_artikel`
JOIN `tb_kategori_artikel` ON `tb_artikel`.`artikel_kategori` = `tb_kategori_artikel`.`kategori_id`
WHERE `artikel_status` = '1'
AND `artikel_akses` = 'Published'
ORDER BY `artikel_create_time` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `tb_pasar`
WHERE `pasar_status` = '1'