app/Models/Page_management_model.php

SELECT *
FROM `tb_management_page`
---
    public function get_all_data()
    {
        return $this->db
            ->table('tb_management_page')
            ->select('*')
            ->get()
            ->getResult();